# language: ru
Функция: Тестирование программы

  Предыстория: Получение файла
    Допустим запуск метода получения файла с переменными окружения из "files/test_files/test_get_file"
    Тогда получение коллекции из файла

  Сценарий: Тестирование команды show
    Пусть тестируется случай "test1"
  Сценарий: Тестирование команды help
    Пусть тестируется случай "test2"
  Сценарий: Тестирование команды add
    Пусть тестируется случай "test3"
  Сценарий: Тестирование команды update
    Пусть тестируется случай "test4"
  Сценарий: Тестирование команды save
    Пусть тестируется случай "test5"
  Сценарий: Тестирование случая когда есть лишние переносы, несуществующие команды, команды с неполным набором аргументов
    Пусть тестируется случай "test6"
  Сценарий: Тестирование remove_first, clear и случая удаления элемента в пустой коллекции
    Пусть тестируется случай "test7"
  Сценарий: Тестирование add_if_max
    Пусть тестируется случай "test8"
  Сценарий: Тестирование add_if_min
    Пусть тестируется случай "test9"
  Сценарий: Тестирование count_by_capacity
    Пусть тестируется случай "test10"
  Сценарий: Тестирование print_ascending
    Пусть тестируется случай "test11"
  Сценарий: Тестирование print_unique_engine_power
    Пусть тестируется случай "test12"
  Сценарий: Тестирование несуществующих команд с аргументами
    Пусть тестируется случай "test13"
  Сценарий: Тестирование микса команд
    Пусть тестируется случай "test14"
  Сценарий: Двойной clear подряд
    Пусть тестируется случай "test15"
  Сценарий: Команды с аргументами без них
    Пусть тестируется случай "test16"
  Сценарий: Тестирование execute_script
    Пусть тестируется случай "test17"
  Сценарий: Зацикливание execute_script
    Пусть тестируется случай "test18"

